Public Attributes | List of all members
API_StairStructureQuantity Struct Reference
Element Manager
Calculated values for the stair structure. More...
#include <APIdefs_Elements.h>
 Public Attributes
 double  | volume
Volume of the stair structure.
 double  | height
Height of the stair structure.
 double  | thickness
Thickness of the stair structure.
 double  | length3D
Length of the stair structure in 3D.
Detailed Description
Calculated values for the stair structure.